/*
Задание 1
Реализуйте базу данных «Кофейня» и добавьте к ней следующие запросы:
■ Добавление информации о новом заказе кофе;
■ Добавление информации о новом заказе десерта;
■ Добавление информации о графике работы в ближайший понедельник;
■ Добавление информации о новом виде кофе.

Задание 2
Добавьте к базе данных «Кофейня» следующие запросы:
■ Изменить расписание работы на ближайший вторник;
■ Изменить название уже существующего вида кофе;
■ Изменить информацию в существующем заказе;
■ Изменить название уже существующего десерта.

Задание 3
Добавьте к базе данных «Кофейня» следующие запросы:
■ Удалить конкретный заказ;
■ Удалить заказы конкретного десерта;
■ Удалите расписание работы на конкретный день;
■ Удалите расписание работы на конкретный промежуток между указанными датами.

Задание 4
Добавьте к базе данных «Кофейня» следующие запросы:
■ Показать все заказы конкретного десерта;
■ Показать расписание работы на конкретный день;
■ Показать все заказы конкретного официанта;
■ Показать все заказы конкретного клиента.

Задание 5
Добавьте к четвертому заданию следующую функциональность:
■ Добавление строки;
■ Удаление строки;
■ Обновление строки
 */

public class Main {
    public static void main(String[] args) {

    }
}